<?

    // 우편번호로 지역 검색용 (지역)
    $SCH_AREA_POSTCODE = [
        "서울" => [
            "start" => "01000",
            "last" => "08866",
        ],

        "부산" => [
            "start" => "46000",
            "last" => "49527",
        ],

        "대구" => [
            "start" => "41000",
            "last" => "43024",
        ],

        "인천" => [
            "start" => "21000",
            "last" => "23136",
        ],

        "광주" => [
            "start" => "61000",
            "last" => "62466",
        ],

        "대전" => [
            "start" => "34000",
            "last" => "35428",
        ],

        "울산" => [
            "start" => "44000",
            "last" => "45015",
        ],

        "세종" => [
            "start" => "30000",
            "last" => "30154",
        ],

        "경기" => [
            "start" => "10000",
            "last" => "18635",
        ],

        "강원" => [
            "start" => "24000",
            "last" => "26509",
        ],

        "충북" => [
            "start" => "27000",
            "last" => "29167",
        ],

        "충남" => [
            "start" => "31000",
            "last" => "33677",
        ],

        "전북" => [
            "start" => "54000",
            "last" => "56469",
        ],

        "전남" => [
            "start" => "57000",
            "last" => "59792",
        ],

        "경북" => [
            "start" => "36000",
            "last" => "40240",
        ],

        "경남" => [
            "start" => "50000",
            "last" => "53337",
        ],

        "제주" => [
            "start" => "63000",
            "last" => "63644",
        ],
    ];

    // 우편번호로 지역 검색용 (시구)
    $SCH_SIGU_POSTCODE = [
        // 서울
        "서울 종로구" => [
            "start" => "03000",
            "last" => "03198",
        ],

        "서울 중구" => [
            "start" => "04500",
            "last" => "04637",
        ],

        "서울 용산구" => [
            "start" => "04300",
            "last" => "04499",
        ],

        "서울 성동구" => [
            "start" => "04700",
            "last" => "04899",
        ],

        "서울 광진구" => [
            "start" => "04900",
            "last" => "05099",
        ],

        "서울 동대문구" => [
            "start" => "02400",
            "last" => "02799",
        ],

        "서울 중랑구" => [
            "start" => "02000",
            "last" => "02299",
        ],

        "서울 성북구" => [
            "start" => "02700",
            "last" => "02999",
        ],

        "서울 강북구" => [
            "start" => "01000",
            "last" => "01399",
        ],

        "서울 도봉구" => [
            "start" => "01300",
            "last" => "01599",
        ],

        "서울 노원구" => [
            "start" => "01600",
            "last" => "01999",
        ],

        "서울 은평구" => [
            "start" => "03300",
            "last" => "03599",
        ],

        "서울 서대문구" => [
            "start" => "03600",
            "last" => "03799",
        ],

        "서울 마포구" => [
            "start" => "03900",
            "last" => "04199",
        ],

        "서울 양천구" => [
            "start" => "07900",
            "last" => "08199",
        ],

        "서울 강서구" => [
            "start" => "07500",
            "last" => "07899",
        ],

        "서울 구로구" => [
            "start" => "08200",
            "last" => "08499",
        ],

        "서울 금천구" => [
            "start" => "08500",
            "last" => "08799",
        ],

        "서울 영등포구" => [
            "start" => "07200",
            "last" => "07499",
        ],

        "서울 동작구" => [
            "start" => "06900",
            "last" => "07199",
        ],

        "서울 관악구" => [
            "start" => "08700",
            "last" => "08999",
        ],

        "서울 서초구" => [
            "start" => "06500",
            "last" => "06899",
        ],

        "서울 강남구" => [
            "start" => "06000",
            "last" => "06399",
        ],

        "서울 송파구" => [
            "start" => "05500",
            "last" => "05899",
        ],

        "서울 강동구" => [
            "start" => "05200",
            "last" => "05499",
        ],

        // 경기도
        "경기 수원시" => [
            "start" => "16200",
            "last" => "16699",
        ],

        "경기 성남시" => [
            "start" => "13100",
            "last" => "13699",
        ],

        "경기 의정부시" => [
            "start" => "11700",
            "last" => "11899",
        ],

        "경기 안양시" => [
            "start" => "13900",
            "last" => "14199",
        ],

        "경기 부천시" => [
            "start" => "14400",
            "last" => "14799",
        ],

        "경기 광명시" => [
            "start" => "14200",
            "last" => "14399",
        ],

        "경기 평택시" => [
            "start" => "17700",
            "last" => "17999",
        ],

        "경기 동두천시" => [
            "start" => "11300",
            "last" => "11399",
        ],

        "경기 안산시" => [
            "start" => "15300",
            "last" => "15799",
        ],

        "경기 고양시" => [
            "start" => "10200",
            "last" => "10699",
        ],

        "경기 과천시" => [
            "start" => "13800",
            "last" => "13899",
        ],

        "경기 구리시" => [
            "start" => "11900",
            "last" => "11999",
        ],

        "경기 남양주시" => [
            "start" => "12100",
            "last" => "12399",
        ],

        "경기 오산시" => [
            "start" => "18100",
            "last" => "18199",
        ],

        "경기 시흥시" => [
            "start" => "14900",
            "last" => "15199",
        ],

        "경기 군포시" => [
            "start" => "15800",
            "last" => "15899",
        ],

        "경기 의왕시" => [
            "start" => "16000",
            "last" => "16099",
        ],

        "경기 하남시" => [
            "start" => "12900",
            "last" => "13099",
        ],

        "경기 용인시" => [
            "start" => "16800",
            "last" => "17199",
        ],

        "경기 파주시" => [
            "start" => "10800",
            "last" => "11099",
        ],

        "경기 이천시" => [
            "start" => "17300",
            "last" => "17399",
        ],

        "경기 안성시" => [
            "start" => "17500",
            "last" => "17599",
        ],

        "경기 김포시" => [
            "start" => "10000",
            "last" => "10199",
        ],

        "경기 화성시" => [
            "start" => "18200",
            "last" => "18599",
        ],

        "경기 광주시" => [
            "start" => "12700",
            "last" => "12899",
        ],

        "경기 양주시" => [
            "start" => "11400",
            "last" => "11599",
        ],

        "경기 포천시" => [
            "start" => "11100",
            "last" => "11299",
        ],

        "경기 여주시" => [
            "start" => "12600",
            "last" => "12699",
        ],

        "경기 연천군" => [
            "start" => "11000",
            "last" => "11099",
        ],

        "경기 가평군" => [
            "start" => "12400",
            "last" => "12499",
        ],

        "경기 양평군" => [
            "start" => "12500",
            "last" => "12599",
        ],

        // 인천
        "인천 중구" => [
            "start" => "22300",
            "last" => "22389",
        ],

        "인천 동구" => [
            "start" => "22500",
            "last" => "22599",
        ],

        "인천 남구" => [  // 미추홀구
            "start" => "22100",
            "last" => "22299",
        ],

        "인천 연수구" => [
            "start" => "21900",
            "last" => "22099",
        ],

        "인천 남동구" => [
            "start" => "21500",
            "last" => "21799",
        ],

        "인천 부평구" => [
            "start" => "21300",
            "last" => "21499",
        ],

        "인천 계양구" => [
            "start" => "21000",
            "last" => "21199",
        ],

        "인천 서구" => [
            "start" => "22700",
            "last" => "22999",
        ],

        "인천 강화군" => [
            "start" => "23000",
            "last" => "23099",
        ],

        "인천 옹진군" => [
            "start" => "23100",
            "last" => "23199",
        ],

        // 강원도
        "강원 춘천시" => [
            "start" => "24200",
            "last" => "24499",
        ],

        "강원 원주시" => [
            "start" => "26300",
            "last" => "26499",
        ],

        "강원 강릉시" => [
            "start" => "25400",
            "last" => "25699",
        ],

        "강원 동해시" => [
            "start" => "25700",
            "last" => "25899",
        ],

        "강원 태백시" => [
            "start" => "26000",
            "last" => "26099",
        ],

        "강원 속초시" => [
            "start" => "24800",
            "last" => "24999",
        ],

        "강원 삼척시" => [
            "start" => "25900",
            "last" => "25999",
        ],

        "강원 홍천군" => [
            "start" => "25100",
            "last" => "25199",
        ],

        "강원 횡성군" => [
            "start" => "25200",
            "last" => "25299",
        ],

        "강원 영월군" => [
            "start" => "26200",
            "last" => "26299",
        ],

        "강원 평창군" => [
            "start" => "25300",
            "last" => "25399",
        ],

        "강원 정선군" => [
            "start" => "26100",
            "last" => "26199",
        ],

        "강원 철원군" => [
            "start" => "24000",
            "last" => "24099",
        ],

        "강원 화천군" => [
            "start" => "24100",
            "last" => "24199",
        ],

        "강원 양구군" => [
            "start" => "24500",
            "last" => "24599",
        ],

        "강원 인제군" => [
            "start" => "24600",
            "last" => "24699",
        ],

        "강원 고성군" => [
            "start" => "24700",
            "last" => "24799",
        ],

        "강원 양양군" => [
            "start" => "25000",
            "last" => "25099",
        ],

        // 충청북도
        "충북 청주시" => [
            "start" => "28100",
            "last" => "28806",
        ],

        "충북 충주시" => [
            "start" => "27300",
            "last" => "27502",
        ],

        "충북 제천시" => [
            "start" => "27100",
            "last" => "27226",
        ],

        "충북 보은군" => [
            "start" => "28900",
            "last" => "28966",
        ],

        "충북 옥천군" => [
            "start" => "29000",
            "last" => "29064",
        ],

        "충북 영동군" => [
            "start" => "29100",
            "last" => "29167",
        ],

        "충북 증평군" => [
            "start" => "27900",
            "last" => "27950",
        ],

        "충북 진천군" => [
            "start" => "27800",
            "last" => "27876",
        ],

        "충북 괴산군" => [
            "start" => "28000",
            "last" => "28065",
        ],

        "충북 음성군" => [
            "start" => "27600",
            "last" => "27740",
        ],

        "충북 단양군" => [
            "start" => "27000",
            "last" => "27029",
        ],

        // 충청남도
        "충남 태안군" => [
            "start" => "32100",
            "last" => "32172",
        ],

        "충남 서산시" => [
            "start" => "31900",
            "last" => "32030",
        ],

        "충남 당진시" => [
            "start" => "31700",
            "last" => "31817",
        ],

        "충남 홍성군" => [
            "start" => "32200",
            "last" => "32299",
        ],

        "충남 예산군" => [
            "start" => "32400",
            "last" => "32457",
        ],

        "충남 아산시" => [
            "start" => "31400",
            "last" => "31584",
        ],

        "충남 천안시" => [
            "start" => "31000",
            "last" => "31261",
        ],

        "충남 보령시" => [
            "start" => "33400",
            "last" => "33522",
        ],

        "충남 청양군" => [
            "start" => "33300",
            "last" => "33368",
        ],

        "충남 공주시" => [
            "start" => "32500",
            "last" => "32626",
        ],

        "충남 서천군" => [
            "start" => "33600",
            "last" => "33677",
        ],

        "충남 부여군" => [
            "start" => "33100",
            "last" => "33232",
        ],

        "충남 논산시" => [
            "start" => "32900",
            "last" => "33028",
        ],

        "충남 계룡시" => [
            "start" => "32800",
            "last" => "32842",
        ],

        "충남 금산군" => [
            "start" => "32700",
            "last" => "32762",
        ],

        // 세종
        "세종 세종특별자치시" => [
            "start" => "30000",
            "last" => "30154",
        ],

        // 대전
        "대전 동구" => [
            "start" => "34500",
            "last" => "34712",
        ],

        "대전 중구" => [
            "start" => "34800",
            "last" => "35086",
        ],

        "대전 서구" => [
            "start" => "35200",
            "last" => "35428",
        ],

        "대전 유성구" => [
            "start" => "34000",
            "last" => "34232",
        ],

        "대전 대덕구" => [
            "start" => "34300",
            "last" => "34445",
        ],

        // 대구
        "대구 중구" => [
            "start" => "41900",
            "last" => "41978",
        ],

        "대구 동구" => [
            "start" => "41000",
            "last" => "41269",
        ],

        "대구 서구" => [
            "start" => "41700",
            "last" => "41872",
        ],

        "대구 남구" => [
            "start" => "42400",
            "last" => "42515",
        ],

        "대구 북구" => [
            "start" => "41400",
            "last" => "41599",
        ],

        "대구 수성구" => [
            "start" => "42000",
            "last" => "42288",
        ],

        "대구 달서구" => [
            "start" => "42600",
            "last" => "42842",
        ],

        "대구 달성군" => [
            "start" => "42900",
            "last" => "43024",
        ],

        // 경상북도
        "경북 포항시" => [
            "start" => "37500",
            "last" => "37948",
        ],

        "경북 경주시" => [
            "start" => "38000",
            "last" => "38221",
        ],

        "경북 김천시" => [
            "start" => "39500",
            "last" => "39698",
        ],

        "경북 안동시" => [
            "start" => "36600",
            "last" => "36760",
        ],

        "경북 구미시" => [
            "start" => "39100",
            "last" => "39459",
        ],

        "경북 영주시" => [
            "start" => "36000",
            "last" => "36175",
        ],

        "경북 영천시" => [
            "start" => "38800",
            "last" => "38913",
        ],

        "경북 상주시" => [
            "start" => "37100",
            "last" => "37276",
        ],

        "경북 문경시" => [
            "start" => "36900",
            "last" => "37003",
        ],

        "경북 경산시" => [
            "start" => "38400",
            "last" => "38698",
        ],

        "경북 군위군" => [
            "start" => "39000",
            "last" => "39066",
        ],

        "경북 의성군" => [
            "start" => "37300",
            "last" => "37375",
        ],

        "경북 청송군" => [
            "start" => "37400",
            "last" => "37465",
        ],

        "경북 영양군" => [
            "start" => "36500",
            "last" => "36564",
        ],

        "경북 영덕군" => [
            "start" => "36400",
            "last" => "36464",
        ],

        "경북 청도군" => [
            "start" => "38300",
            "last" => "38368",
        ],

        "경북 고령군" => [
            "start" => "40100",
            "last" => "40166",
        ],

        "경북 성주군" => [
            "start" => "40000",
            "last" => "40066",
        ],

        "경북 칠곡군" => [
            "start" => "39800",
            "last" => "39915",
        ],

        "경북 예천군" => [
            "start" => "36800",
            "last" => "36867",
        ],

        "경북 봉화군" => [
            "start" => "36200",
            "last" => "36273",
        ],

        "경북 울진군" => [
            "start" => "36300",
            "last" => "36371",
        ],

        "경북 울릉군" => [
            "start" => "40200",
            "last" => "40240",
        ],

        // 경상남도
        "경남 창원시" => [
            "start" => "51100",
            "last" => "51797",
        ],

        "경남 진주시" => [
            "start" => "52600",
            "last" => "52859",
        ],

        "경남 통영시" => [
            "start" => "53000",
            "last" => "53104",
        ],

        "경남 사천시" => [
            "start" => "52500",
            "last" => "52571",
        ],

        "경남 김해시" => [
            "start" => "50800",
            "last" => "51025",
        ],

        "경남 밀양시" => [
            "start" => "50400",
            "last" => "50467",
        ],

        "경남 거제시" => [
            "start" => "53200",
            "last" => "53337",
        ],

        "경남 양산시" => [
            "start" => "50500",
            "last" => "50658",
        ],

        "경남 의령군" => [
            "start" => "52100",
            "last" => "52160",
        ],

        "경남 함안군" => [
            "start" => "52000",
            "last" => "52073",
        ],

        "경남 창녕군" => [
            "start" => "50300",
            "last" => "50367",
        ],

        "경남 고성군" => [
            "start" => "52900",
            "last" => "52963",
        ],

        "경남 남해군" => [
            "start" => "52400",
            "last" => "52455",
        ],

        "경남 하동군" => [
            "start" => "52300",
            "last" => "52355",
        ],

        "경남 산청군" => [
            "start" => "52200",
            "last" => "52264",
        ],

        "경남 함양군" => [
            "start" => "50000",
            "last" => "50057",
        ],

        "경남 거창군" => [
            "start" => "50100",
            "last" => "50153",
        ],

        "경남 합천군" => [
            "start" => "50200",
            "last" => "50253",
        ],

        // 울산
        "울산 중구" => [
            "start" => "44400",
            "last" => "44553",
        ],

        "울산 남구" => [
            "start" => "44600",
            "last" => "44787",
        ],

        "울산 동구" => [
            "start" => "44000",
            "last" => "44115",
        ],

        "울산 북구" => [
            "start" => "44200",
            "last" => "44264",
        ],

        "울산 울주군" => [
            "start" => "44900",
            "last" => "45015",
        ],

        // 부산
        "부산 중구" => [
            "start" => "48900",
            "last" => "48984",
        ],

        "부산 서구" => [
            "start" => "49200",
            "last" => "49277",
        ],

        "부산 동구" => [
            "start" => "48700",
            "last" => "48822",
        ],

        "부산 영도구" => [
            "start" => "49000",
            "last" => "49128",
        ],

        "부산 부산진구" => [
            "start" => "47100",
            "last" => "47398",
        ],

        "부산 동래구" => [
            "start" => "47700",
            "last" => "47906",
        ],

        "부산 남구" => [
            "start" => "48400",
            "last" => "48595",
        ],

        "부산 북구" => [
            "start" => "46500",
            "last" => "46653",
        ],

        "부산 해운대구" => [
            "start" => "48000",
            "last" => "48120",
        ],

        "부산 사하구" => [
            "start" => "49300",
            "last" => "49527",
        ],

        "부산 금정구" => [
            "start" => "46200",
            "last" => "46335",
        ],

        "부산 강서구" => [
            "start" => "46700",
            "last" => "46771",
        ],

        "부산 연제구" => [
            "start" => "47500",
            "last" => "47616",
        ],

        "부산 수영구" => [
            "start" => "48200",
            "last" => "48318",
        ],

        "부산 사상구" => [
            "start" => "46900",
            "last" => "47055",
        ],

        "부산 기장군" => [
            "start" => "46000",
            "last" => "46084",
        ],

        // 전라북도
        "전북 전주시" => [
            "start" => "54877",
            "last" => "55151",
        ],

        "전북 군산시" => [
            "start" => "54000",
            "last" => "54179",
        ],

        "전북 익산시" => [
            "start" => "54500",
            "last" => "54679",
        ],

        "전북 정읍시" => [
            "start" => "56100",
            "last" => "56216",
        ],

        "전북 남원시" => [
            "start" => "55700",
            "last" => "55805",
        ],

        "전북 김제시" => [
            "start" => "54300",
            "last" => "54426",
        ],

        "전북 완주군" => [
            "start" => "55300",
            "last" => "55368",
        ],

        "전북 진안군" => [
            "start" => "55400",
            "last" => "55460",
        ],

        "전북 무주군" => [
            "start" => "55500",
            "last" => "55563",
        ],

        "전북 장수군" => [
            "start" => "55600",
            "last" => "55662",
        ],

        "전북 임실군" => [
            "start" => "55900",
            "last" => "55957",
        ],

        "전북 순창군" => [
            "start" => "56000",
            "last" => "56059",
        ],

        "전북 고창군" => [
            "start" => "56400",
            "last" => "56469",
        ],

        "전북 부안군" => [
            "start" => "56300",
            "last" => "56349",
        ],

        // 전라남도
        "전남 목포시" => [
            "start" => "58600",
            "last" => "58763",
        ],

        "전남 여수시" => [
            "start" => "59600",
            "last" => "59792",
        ],

        "전남 순천시" => [
            "start" => "57900",
            "last" => "58035",
        ],

        "전남 나주시" => [
            "start" => "58200",
            "last" => "58330",
        ],

        "전남 광양시" => [
            "start" => "57700",
            "last" => "57817",
        ],

        "전남 담양군" => [
            "start" => "57300",
            "last" => "57393",
        ],

        "전남 곡성군" => [
            "start" => "57500",
            "last" => "57562",
        ],

        "전남 구례군" => [
            "start" => "57600",
            "last" => "57662",
        ],

        "전남 고흥군" => [
            "start" => "59500",
            "last" => "59572",
        ],

        "전남 보성군" => [
            "start" => "59400",
            "last" => "59475",
        ],

        "전남 화순군" => [
            "start" => "58100",
            "last" => "58165",
        ],

        "전남 장흥군" => [
            "start" => "59300",
            "last" => "59366",
        ],

        "전남 강진군" => [
            "start" => "59200",
            "last" => "59269",
        ],

        "전남 해남군" => [
            "start" => "59000",
            "last" => "59067",
        ],

        "전남 영암군" => [
            "start" => "58400",
            "last" => "58467",
        ],

        "전남 무안군" => [
            "start" => "58500",
            "last" => "58580",
        ],

        "전남 함평군" => [
            "start" => "57100",
            "last" => "57167",
        ],

        "전남 영광군" => [
            "start" => "57000",
            "last" => "57069",
        ],

        "전남 장성군" => [
            "start" => "57200",
            "last" => "57257",
        ],

        "전남 완도군" => [
            "start" => "59100",
            "last" => "59170",
        ],

        "전남 진도군" => [
            "start" => "58900",
            "last" => "58958",
        ],

        "전남 신안군" => [
            "start" => "58800",
            "last" => "58866",
        ],

        // 광주
        "광주 동구" => [
            "start" => "61400",
            "last" => "61514",
        ],

        "광주 서구" => [
            "start" => "61900",
            "last" => "62078",
        ],

        "광주 남구" => [
            "start" => "61600",
            "last" => "61768",
        ],

        "광주 북구" => [
            "start" => "61000",
            "last" => "61273",
        ],

        "광주 광산구" => [
            "start" => "62200",
            "last" => "62466",
        ],

        // 제주
        "제주 제주시" => [
            "start" => "63000",
            "last" => "63365",
        ],

        "제주 서귀포시" => [
            "start" => "63500",
            "last" => "63644",
        ],
    ];



    // 지역
    if ($_GET['area']) {
        $area = $SCH_AREA[$_GET['area']] ?? '';

        if (!empty($area)) {
            $areaPostCode = $SCH_AREA_POSTCODE[$area];
            $makeWhere .= " AND office_zipcode BETWEEN {$areaPostCode['start']} AND {$areaPostCode['last']}";
        }
    }

    // 지역 (시군구)
    if ($_GET['area'] && $_GET['area_sub']) {
        $sumAreaSub = $_GET['area'] . ' ' . $_GET['area_sub'];
        $sigunguPostCOde = $SCH_SIGUNGU_POSTCODE[$sumAreaSub] ?? '';

        if (!empty($sigunguPostCOde)) {
            $makeWhere .= " AND office_zipcode BETWEEN {$sigunguPostCOde['start']} AND {$sigunguPostCOde['last']}";
        }
    }